"""
https://stepik.org/lesson/794484/step/18?unit=797232

Декоратор @recviz🌶️🌶️
Реализуйте декоратор @recviz, который полностью визуализирует выполнение декорируемой функции, в том числе и рекурсивной. Декоратор должен отображать все рекурсивные вызовы и возвращаемые значения, полученные при этих вызовах, причем рекурсивные вызовы, выполняемые в глубину, должны отделяться друг от друга четырьмя пробелами.

Очередной вызов декорируемой функции при визуализации должен включать в себя знак ->, имя декорируемой функции и аргументы, переданные при этом вызове. Возвращаемое значение при визуализации должно включать в себя знак <- и непосредственно само возвращаемое значение.

Примечание 1. Рекурсивный вызов и возвращаемое значение, полученное при этом вызове, должны находиться на одном уровне отступов.

Примечание 2. Не забывайте, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов.
"""

def recviz(func):
    tabs = -1
    def wrapper(*args, **kwargs):
        nonlocal tabs
        tabs += 1
        a = [repr(i) for i in args]
        kwa = [f'{k}={repr(v)}' for k, v in kwargs.items()]
        print(f'{"    "*tabs}-> {func.__name__}({", ".join((a + kwa))})')
        f = func(*args, **kwargs)
        print(f'{"    "*tabs}<- {repr(f)}')
        tabs -= 1
        return f
    return wrapper
