"""
https://stepik.org/lesson/841344/step/24?unit=844978

Семья
С помощью множественного наследования постройте иерархию из приведенных ниже четырех классов. При решении старайтесь свести дублирование кода к минимуму.

1. Реализуйте класс Father, описывающий отца. При создании экземпляра класс должен принимать один аргумент:

mood — настроение, по умолчанию равняется строкеneutral
Экземпляр класса Father должен иметь один атрибут:

mood — настроение
Класс Father должен иметь два метода экземпляра:

greet() — метод, возвращающий строку Hello!
be_strict() — метод, изменяющий значение атрибута mood на строку strict
2. Также реализуйте класс Mother, описывающий мать. При создании экземпляра класс должен принимать один аргумент:

mood — настроение, по умолчанию равняется строке neutral
Экземпляр класса Mother должен иметь один атрибут:

mood — настроение
Класс Mother должен иметь два метода экземпляра:

greet() — метод, возвращающий строку Hi, honey!
be_kind() — метод, изменяющий значение атрибута mood на строку kind
3. Помимо этого, реализуйте класс Daughter, описывающий дочь. При создании экземпляра класс должен принимать один аргумент:

mood — настроение, по умолчанию равняется строке neutral
Экземпляр класса Daughter должен иметь один атрибут:

mood — настроение
Класс Daughter должен иметь три метода экземпляра:

greet() — метод, возвращающий строку Hi, honey!
be_kind() — метод, изменяющий значение атрибута mood на строку kind
be_strict() — метод, изменяющий значение атрибута mood на строку strict
4. Наконец, реализуйте класс Son, описывающий сына. При создании экземпляра класс должен принимать один аргумент:

mood — настроение, по умолчанию равняется строке neutral
Экземпляр класса Son должен иметь один атрибут:

mood — настроение
Класс Son должен иметь три метода экземпляра:

greet() — метод, возвращающий строку Hello!
be_kind() — метод, изменяющий значение атрибута mood на строку kind
be_strict() — метод, изменяющий значение атрибута mood на строку strict
"""

class Father:

    def __init__(self, mood='neutral'):
        self.mood = mood

    def greet(self):
        return 'Hello!'

    def be_strict(self):
        self.mood = 'strict'

class Mother:

    def __init__(self, mood='neutral'):
        self.mood = mood

    def greet(self):
        return 'Hi, honey!'

    def be_kind(self):
        self.mood = 'kind'

class Daughter(Mother, Father):
    pass

class Son(Father, Mother):
    pass
