"""
https://stepik.org/lesson/835206/step/15?auth=login&unit=838840

Декоратор @auto_repr🌶️
Реализуйте декоратор @auto_repr для декорирования класса. Декоратор должен принимать два аргумента в следующем порядке:

args — список имен атрибутов
kwargs — список имен атрибутов
Декоратор должен реализовывать формальное строковое представление для экземпляров декорируемого класса. Строковое представление должно содержать имя класса и значения атрибутов экземпляра класса и иметь вид:

<имя класса>(<атрибут>, <атрибут>, ...)
Если атрибут указан в списке args, в строковом представлении должно быть только его значение, если же атрибут указан в списке kwargs, в строковом представлении должно быть его значение вместе с именем.

Примечание 1. Атрибуты в форматированной строке должны располагаться в том порядке, в котором они были присвоены экземпляру.

Примечание 2. Гарантируется, что при декорировании указываются все необходимые имена атрибутов. Также гарантируется, что имя атрибута указывается либо только в списке args, либо только в списке kwargs. Причем порядок расположения имен атрибутов в списках args и kwargs повторяет их расположение в сигнатуре инициализатора декорируемого класса.
"""

def auto_repr(args, kwargs):
    def decorator(cls):
        def r(self):
            a = [f'{self.__dict__[value]!r}' for value in args if value in self.__dict__]
            kw = [f'{k}={v!r}' for k, v in self.__dict__.items() if k in kwargs]
            return f'{cls.__name__}({", ".join(a+kw)})'
        cls.__repr__ = r
        return cls
    return decorator

