"""
https://stepik.org/lesson/570055/step/10?unit=564599

Функция calculate_it()
Реализуйте функцию calculate_it(), которая принимает один или более аргументов в следующем порядке:

func — произвольная функция
*args — переменное количество позиционных аргументов, каждый из которых является произвольным объектом
Функция должна возвращать кортеж, первым элементом которого является возвращаемое значение функции func при вызове с аргументами *args, а вторым — примерное время (в секундах), затраченное на вычисление этого значения.

Примечание 1. Например, если функция add() определена так:

def add(a, b, c):
    time.sleep(3)
    return a + b + c
то вызов

calculate_it(add, 1, 2, 3)
должен вернуть кортеж (6, 3.000720262527466), где 6 — результат вызова add(1, 2, 3), а 3.000720262527466 — примерное время работы функции add() в секундах.

Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимую функцию calculate_it(), но не код, вызывающий ее.
"""

import time

def calculate_it(func, *args):
    start = time.time()
    result = func(*args)
    end = time.time()
    elapsed = end - start
    return result, elapsed