"""
https://stepik.org/lesson/872533/step/23?unit=876917

Класс CustomRange
Назовем диапазоном запись двух целых неотрицательных чисел через дефис a-b, где a — левая граница диапазона, b — правая граница диапазона, причем a <= b. Диапазон содержит в себе все числа от a до b включительно. Например, диапазон 1-4 содержит числа 1, 2, 3 и 4.

Реализуйте класс CustomRange, описывающий последовательность, элементами которой являются одиночные целые числа и числа из определенных диапазонов. При создании экземпляра класс должен принимать произвольное количество позиционных аргументов, каждый из которых является одиночным целым числом либо диапазоном.

При передаче экземпляра класса CustomRange в функцию len() должно возвращаться количество элементов в нем. При передаче экземпляра класса CustomRange в функцию reversed() должен возвращаться итератор, элементами которого являются элементы переданного экземпляра класса CustomRange, расположенные в обратном порядке.

Экземпляр класса CustomRange должен быть итерируемым объектом, то есть позволять перебирать свои элементы, например, с помощью цикла for.

Помимо этого, экземпляр класса CustomRange должен поддерживать операцию проверки на принадлежность с помощью оператора in.

Наконец, экземпляр класса CustomRange должен позволять получать значения своих элементов с помощью индексов, причем как как положительных, так и отрицательных
"""

from collections.abc import Sequence

class CustomRange(Sequence):

    def __init__(self, *args):
        self.seq = list()
        for i in args:
            if isinstance(i, int):
                self.seq.append(i)
            if isinstance(i, str):
                tmp = list(map(int, i.split('-')))
                tmp = range(tmp[0], tmp[1]+1)
                self.seq += list(tmp)
    def __getitem__(self, item):
        return self.seq[item]

    def __len__(self):
        return len(self.seq)

