"""
https://stepik.org/lesson/798678/step/20?unit=801641

Классы Summator и подклассы🌶️
1. Реализуйте класс Summator, описывающий объект, вычисляющий сумму натуральных чисел от

1+2+3+...+n
При создании экземпляра класс не должен принимать никаких аргументов.

Класс Summator должен иметь один метод экземпляра:

total() — метод, принимающий в качестве аргумента целое число n и возвращающий сумму целых чисел от 1 до n включительно
2. Помимо этого, реализуйте класс SquareSummator, наследника класса Summator, описывающий объект, вычисляющий сумму квадратов натуральных чисел от

Процесс создания экземпляра класса SquareSummator должен совпадать с процессом создания экземпляра класса Summator.

Класс SquareSummator должен иметь один метод экземпляра:

total() — метод, принимающий в качестве аргумента целое число n и возвращающий сумму квадратов целых чисел от 1 до n включительно
3. Также реализуйте класс QubeSummator, наследника класса Summator, описывающий объект, вычисляющий сумму кубов натуральных чисел от

Процесс создания экземпляра класса QubeSummator должен совпадать с процессом создания экземпляра класса Summator.

Класс QubeSummator должен иметь один метод экземпляра:

total() — метод, принимающий в качестве аргумента целое число n и возвращающий сумму кубов целых чисел от 1 до n включительно
4. Наконец, реализуйте класс CustomSummator, наследника класса Summator, описывающий объект, вычисляющий сумму произвольных степеней натуральных чисел от

При создании экземпляра класс должен принимать один аргумент:

m — степень чисел в последовательности
Класс CustomSummator должен иметь один метод экземпляра:

total() — метод, принимающий в качестве аргумента целое число n и возвращающий сумму целых чисел в степени m от 1 до n включительно
Примечание 1. Попытайтесь реализовать классы таким образом, чтобы метод total() был определен лишь в классе Summator.
"""

class Summator:

    def __init__(self, p=1):
        self.power = p

    def total(self, p):
        return sum(i ** self.power for i in range(1, p+1))

class SquareSummator(Summator):
    def __init__(self):
        super().__init__(2)

class QubeSummator(Summator):

    def __init__(self):
        super().__init__(3)

class CustomSummator(Summator):

    def __init__(self, m):
        super().__init__(m)
