"""
https://stepik.org/lesson/637962/step/6?unit=634429

Подозрительно просто 🤐
Напишите программу с использованием рекурсии, которая выводит последовательность натуральных чисел от 11 до 100100 включительно.

Формат входных данных
На вход программе ничего не подается.

Формат выходных данных
Программа должны вывести последовательность натуральных чисел от 11 до 100100 включительно, каждое на отдельной строке.

Примечание. Начальная часть ответа выглядит так:

1
2
3
4. Files
5
...
"""

def hundred(n):
    if n <= 100:
        print(n)
        hundred(n+1)

hundred(1)