"""
https://stepik.org/lesson/933767/step/13?unit=939666

Класс Atomic 🌶️
Реализуйте класс Atomic. При создании экземпляра класс должен принимать два аргумента в следующем порядке:

data — произвольный список, множество или словарь
deep — булево значение, по умолчанию равняется False
Экземпляр класса Atomic должен являться контекстным менеджером, который позволяет выполнять операции над коллекцией data внутри блока with в атомарном режиме, то есть либо все операции должны быть выполнены, либо ни одна из них. Если все операции корректны (не приводят к возбуждению исключения), они должны быть применены к коллекции data. Если какая-либо операция некорректна, все ранее выполненные операции должны быть отменены, а коллекция data должна быть возвращена в исходное состояние.

Параметр deep должен определять состояние вложенных структур коллекции data после завершения блока with. Если он имеет значение False, контекстный менеджер должен возвращать в исходное состояние только саму коллекцию data, не затрагивая ее вложенные структуры. Например, если data является двумерным списком и внутри блока with произошло изменение одного из его вложенных списков, то этот вложенный список должен сохранить свое новое состояние, даже если последующие операции внутри блока with приведут к возбуждению исключения и возврату коллекции data в исходное состояние. Если же параметр deep имеет значение True, контекстный менеджер должен возвращать в исходное состояние не только саму коллекцию data, но и ее вложенные структуры.
"""

from copy import deepcopy
class Atomic:

    def __init__(self, data, deep=False):
        self.data = data
        self._data = deepcopy(data)
        self.deep = deep

    def __enter__(self):
        return self.data


    def __exit__(self, exc_type, exc_val, exc_tb):
        if exc_type:
            self.data = self._data
        return self._data

numbers = [1, 2, 3, 4, 5]

with Atomic(numbers) as atomic:
    atomic.append(6)
    atomic[2] = 0
    del atomic[100]           # обращение по несуществующему индексу

print(numbers)
