"""
https://stepik.org/lesson/571244/step/4?unit=565785

Самое понятное условие
Даны две даты — левая и правая границы диапазона соответственно. Напишите программу, которая из этого диапазона, включая границы, выводит, начиная с даты, у которой сумма дня и месяца нечетная, каждую третью дату, только если она не понедельник и не четверг.

Формат входных данных
На вход программе подаются две даты в формате DD.MM.YYYY — левая и правая границы диапазона соответственно, каждая на отдельной строке. Гарантируется, что первая дата не больше второй.

Формат выходных данных
Программа должна из указанного диапазона, включая концы, вывести, начиная с даты, у которой сумма дня и месяца нечетная, каждую третью дату, только если она не понедельник и не четверг. Даты должны быть расположены каждая на отдельной строке, в формате DD.MM.YYYY.

Примечание 1. Если дат, удовлетворяющих условию, нет, программа ничего не должна выводить.

Примечание 2. Рассмотрим второй тест. Левая граница диапазона 07.03.2021 не является начальной датой, так как имеет четную сумму дня и месяца, поэтому в качестве начальной берем следующую дату 08.03.2021. Дата 08.03.2021 не выводится, так как является понедельником, поэтому двигаемся к следующей дате с шагом три: 11.03.2021. Дата 11.03.2021 не выводится, так как является четвергом.

Примечание 3. Тестовые данные доступны по ссылке.

Sample Input 1:

01.11.2021
10. Iterators & generatoes.11.2021
Sample Output 1:

02.11.2021
05.11.2021
Sample Input 2:

07.03.2021
13.03.2021
Sample Output 2:

Sample Input 3:

06.11.2021
27.11.2021
Sample Output 3:

06.11.2021
09.11.2021
12.11.2021
21.11.2021
24.11.2021
27.11.2021
"""

import sys
from datetime import date, timedelta, datetime
import sys

a, b, c = input().split('.')
date1 = date(int(c), int(b), int(a))
a, b, c = input().split('.')
date2 = date(int(c), int(b), int(a))
if date1 == date2 and date1.weekday() not in (0, 3):
    print(date1.strftime('%d.%m.%Y'))
    sys.exit()
today = date1
start = None
while today != date2:
    if (today.day + today.month) % 2:
        start = today
        break
    today += timedelta(days=1)

if start != None:
    while start <= date2:
        if start.weekday() not in(0, 3):
            print(start.strftime('%d.%m.%Y'))
        start += timedelta(days=3)


