"""
https://stepik.org/lesson/680669/step/14?unit=679339

Задача о рюкзаке
Вам доступен список items, содержащий набор предметов. Каждый предмет представлен в виде именованного кортежа и имеет три параметра — название, массу (в граммах) и ценность (в рублях). Также имеется рюкзак определённой грузоподъёмности.

Напишите программу, которая определяет, какие предметы из представленного набора следует взять, чтобы собрать рюкзак с максимальной ценностью предметов внутри, соблюдая при этом весовое ограничение рюкзака.

Формат входных данных
На вход программе в первой строке подается число — грузоподъемность рюкзака (в граммах).

Формат выходных данных
Программа должна определить какие предметы из представленного набора следует взять, чтобы собрать рюкзак с максимальной ценностью предметов внутри, соблюдая при этом весовое ограничение рюкзака, и вывести названия полученных предметов в лексикографическом порядке, каждое на отдельной строке. Если рюкзак не позволяет взять ни один предмет, программа должна вывести текст:

Рюкзак собрать не удастся
Примечание 1. Рюкзак не обязательно должен быть наполнен полностью.
"""
import sys
from collections import namedtuple
import itertools

Item = namedtuple('Item', ['name', 'mass', 'price'])

items = [Item('Обручальное кольцо', 7, 49_000),
         Item('Мобильный телефон', 200, 110_000),
         Item('Ноутбук', 2000, 150_000),
         Item('Ручка Паркер', 20, 37_000),
         Item('Статуэтка Оскар', 4000, 28_000),
         Item('Наушники', 150, 11_000),
         Item('Гитара', 1500, 32_000),
         Item('Золотая монета', 8, 140_000),
         Item('Фотоаппарат', 720, 79_000),
         Item('Лимитированные кроссовки', 300, 80_000)]

min_price = min(i[1] for i in items)
capacity = int(input())
if capacity < min_price:                        # проверка что в рюкзак влезет хотя бы одна вещь с минимальным весом
    print('Рюкзак собрать не удастся')
    sys.exit()

combs = []                                      # сюда складируем только те комбинации, масса которых не больше ёмкости рюкзака

for i in range(len(items) + 1):
    tmp = itertools.combinations((items), i)
    for j in tmp:
        if min_price <= sum(i[1] for i in j) <= capacity:
            combs.append(j)

m = 0
most_valuable = None                                        # определение самой ценной комбинации
for i in combs:
    tmp = sum(j[2] for j in i)
    if tmp > m:
        m = tmp
        most_valuable = i

for i in sorted(most_valuable, key=lambda x: x.name):      # вывод содержимого рюкзака
    print(i.name)