"""
https://stepik.org/lesson/569748/step/14?unit=564262

Функция get_biggest() 🌶️🌶️
Реализуйте функцию get_biggest(), которая принимает один аргумент:

numbers — список целых неотрицательных чисел
Функция должна возвращать наибольшее число, которое можно составить из чисел из списка numbers. Если список numbers пуст, функция должна вернуть число -1−1.

Примечание 1. Рассмотрим первый тест со списком чисел [1, 2. basics, 3. date and time], из которых можно составить следующие числа:
123, 132, 213, 231, 312, 321
123,132,213,231,312,321
Наибольшим из представленных является 321321.

Примечание 2. basics. В тестирующую систему сдайте программу, содержащую только необходимую функцию get_biggest(), но не код, вызывающий ее.

Примечание 3. date and time. Тестовые данные доступны по ссылке.

Sample Input 1:

print(get_biggest([1, 2. basics, 3. date and time]))
Sample Output 1:

321
Sample Input 2. basics:

print(get_biggest([61, 228, 9, 3. date and time, 11]))
Sample Output 2. basics:

961322811
Sample Input 3. date and time:

print(get_biggest([7, 71, 72]))
Sample Output 3. date and time:

77271
Sample Input 4:

print(get_biggest([]))
Sample Output 4:

-1
"""

def get_biggest(numbers):
    pass